[
  {
    "id": "1",
    "img": "/works/work-xcorp.webp",
    "alt": "corporate site",
    "title": "Corporate Site",
    "desc": "Modern responsive design with animations, videos and images to reflect a professional Mock-up corporate site. features multi-lingual support, LinkedIn Feed, Article Sections, Staff introduction and Contact Area.",
    "tools": "React, TypeScript",
    "link": "./"
  },
  {
    "id": "2",
    "img": "/works/work-blog.webp",
    "alt": "gamer blog site",
    "title": "Gamer Blog Site",
    "desc": "Gamer-Oriented blog site with fun and responsive design. Features article pages, store and social media links.",
    "tools": "HTML5, CSS, JavaScript, EJS",
    "link": "./"
  },
  {
    "id": "3",
    "img": "/works/work-artist.webp",
    "alt": "visual artist portfolio landing page",
    "title": "Visual Artist Landing Page",
    "desc": "Responsive landing page with minimalist design displaying a selection of the artist's work by gallery, with links to social media. This LP is accesed by QR code on the artist's business card, with the goal of allowing potential clients to preview her work.",
    "tools": "React, CSS, TypeScript, Python",
    "link": "./"
  },
  {
    "id": "4",
    "img": "/works/work-hamster.webp",
    "alt": "gaming site",
    "title": "Gaming Site",
    "desc": "Gaming site with personally built playable games made in TypeScript. The site features sign-up for users to track their scores, and a responsive design allowing games to be played across devices.",
    "tools": "Django, HTML5, CSS, JavaScript, TypeScript, SQLite",
    "link": "./"
  },
  {
    "id": "5",
    "img": "/works/work-harry.webp",
    "alt": "fast-food mobile site",
    "title": "Fast-Food Mobile Site",
    "desc": "Fictional fast-food restaurant mock-up mobile-first site, clean minimalist design with menu items and deals displayed in an easy to navigate layout. Features recruitment page and dynamic shopping cart.",
    "tools": "HTML5, CSS, JavaScript",
    "link": "./"
  },
  {
    "id": "6",
    "img": "/works/work-devtools.webp",
    "alt": "developer tools site",
    "title": "Developer Tools Site",
    "desc": "A site for developers with 8 personally built tools such as a URL debugger, dummy image creator, and Word to HTML builder. React frontend with a Python and Node.JS backend.",
    "tools": "React, TypeScript, Node.JS, Python",
    "link": "./"
  }
]
